RuanJG/stm32App/source/app/app_CSWL_Control_Board.c
	console_init( CONSOLE_UART_TYPE ,CONSOLE_UART , NULL, 0);
	//console_init( CONSOLE_USB_TYPE ,NULL );
	
}




#if CSWL_CONTROL_BOARD_V2

#define RELAY_OUTPUT_TO_SHAVE(X) GPIO_WriteBit( GPIOC, GPIO_Pin_6 ,0); GPIO_WriteBit( GPIOC, GPIO_Pin_5 ,X)
#define RELAY_OUTPUT_TO_METER(X) GPIO_WriteBit( GPIOA, GPIO_Pin_7 ,0); GPIO_WriteBit( GPIOA, GPIO_Pin_6 ,X)
#define RELAY_OUTPUT_TO_RESISTOR(X) GPIO_WriteBit( GPIOA, GPIO_Pin_5 ,0); GPIO_WriteBit( GPIOA, GPIO_Pin_4 ,X)
#define RELAY_VDD_TO_METER(X) if( X==1 ){GPIO_WriteBit( GPIOA, GPIO_Pin_7 ,0); GPIO_WriteBit( GPIOA, GPIO_Pin_6 ,0);}
#define RELAY_POWER_TO_CSWL(X) GPIO_WriteBit( GPIOB, GPIO_Pin_2 ,0); GPIO_WriteBit( GPIOB, GPIO_Pin_1 ,X)


#define SIGNAL_TO_AIRPRESS(X) GPIO_WriteBit( GPIOC, GPIO_Pin_8 ,0); GPIO_WriteBit( GPIOC, GPIO_Pin_4 ,X)

#define INDEX_SHAVE  0x1
#define INDEX_RESISTOR 0x2
#define INDEX_OUTPUT_METER 0x8
#define INDEX_VDD_METER 0x4
#define INDEX_POWER  0x10
#define INDEX_SIGNAL 0x20

volatile unsigned char relay_status;

void relay_update_status( unsigned char status )
{

	SIGNAL_TO_AIRPRESS( ((INDEX_SIGNAL & status)==0 ? 0: 1) );
	RELAY_OUTPUT_TO_SHAVE( ((INDEX_SHAVE & status)==0 ? 0: 1) );
	RELAY_OUTPUT_TO_METER( ((INDEX_OUTPUT_METER & status)==0 ? 0: 1) );
	RELAY_OUTPUT_TO_RESISTOR( ((INDEX_RESISTOR & status)==0 ? 0: 1) );
	RELAY_VDD_TO_METER( ((INDEX_VDD_METER & status)==0 ? 0: 1) );
	RELAY_POWER_TO_CSWL( ((INDEX_POWER & status)==0 ? 0: 1) );
	relay_status = status;
}

void relay_init()
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC,ENABLE);

	GPIO_StructInit(&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5| GPIO_Pin_6| GPIO_Pin_8;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	relay_update_status(0);


}

#endif




#if CSWL_CONTROL_BOARD_V1

#define RELAY_ON 0
#define RELAY_OFF 1

#define RELAY_OUTPUT_TO_SHAVE(X) GPIO_WriteBit( GPIOC, GPIO_Pin_5 , X==1? RELAY_ON:RELAY_OFF)
#define RELAY_OUTPUT_TO_METER(X) GPIO_WriteBit( GPIOC, GPIO_Pin_7 , X==1? RELAY_ON:RELAY_OFF)
#define RELAY_OUTPUT_TO_RESISTOR(X) GPIO_WriteBit( GPIOC, GPIO_Pin_6 , X==1? RELAY_ON:RELAY_OFF)
#define RELAY_VDD_TO_METER(X) GPIO_WriteBit( GPIOC, GPIO_Pin_4 , X==1? RELAY_ON:RELAY_OFF)
#define RELAY_POWER_TO_CSWL(X) GPIO_WriteBit( GPIOC, GPIO_Pin_8 , X==1? RELAY_ON:RELAY_OFF)

#define SIGNAL_ON 1
#define SIGNAL_OFF 0
#define SIGNAL_TO_AIRPRESS(X) GPIO_WriteBit( GPIOA, GPIO_Pin_1 , X==1? SIGNAL_ON:SIGNAL_OFF)

#define INDEX_SHAVE  0x1
#define INDEX_RESISTOR 0x2
#define INDEX_OUTPUT_METER 0x8
#define INDEX_VDD_METER 0x4
#define INDEX_POWER  0x10
#define INDEX_SIGNAL 0x20

volatile unsigned char relay_status;

void relay_update_status( unsigned char status )
{

	SIGNAL_TO_AIRPRESS( ((INDEX_SIGNAL & status)==0 ? 0: 1) );
	RELAY_OUTPUT_TO_SHAVE( ((INDEX_SHAVE & status)==0 ? 0: 1) );
	RELAY_OUTPUT_TO_METER( ((INDEX_OUTPUT_METER & status)==0 ? 0: 1) );
	RELAY_OUTPUT_TO_RESISTOR( ((INDEX_RESISTOR & status)==0 ? 0: 1) );
	RELAY_VDD_TO_METER( ((INDEX_VDD_METER & status)==0 ? 0: 1) );
	RELAY_POWER_TO_CSWL( ((INDEX_POWER & status)==0 ? 0: 1) );
	relay_status = status;
}

void relay_init()
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC,ENABLE);

	GPIO_StructInit(&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5| GPIO_Pin_6| GPIO_Pin_7| GPIO_Pin_8;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	relay_update_status(0);


}

#endif






#define SW_INTERVAL_COUNT  40  // SW_INTERVAL_MS 检查一次GPIO口， SW_INTERVAL_COUNT次后发出按键事件, 用作过滤
#define SW_INTERVAL_TOLERANCE 10 // 25%
#define SW_INTERVAL_MS 5
systick_time_t sw_timer;
struct switcher startButton;
//volatile unsigned char startButton_triggered =0 ;

void switch_key_press_handler()
{
	unsigned char data = 1;
	PMSG_send_msg( &PC_pmsg , PC_TAG_DATA_BUTTON , (unsigned char*)&data, 1 );
}

void switch_init()
{
	
#if CSWL_CONTROL_BOARD_V2
	switcher_init( &startButton, SW_INTERVAL_COUNT ,SW_INTERVAL_TOLERANCE , 1 , 0 , GPIOA, GPIO_Pin_0, GPIO_Mode_IN_FLOATING, switch_key_press_handler , NULL);
#endif
#if CSWL_CONTROL_BOARD_V1
	switcher_init( &startButton, SW_INTERVAL_COUNT, SW_INTERVAL_TOLERANCE, 1 , 0 , GPIOB, GPIO_Pin_5, GPIO_Mode_IN_FLOATING, switch_key_press_handler, NULL);
#endif
	
	systick_init_timer( &sw_timer, SW_INTERVAL_MS );
}

void switch_even()
{
	if( 0 == systick_check_timer( &sw_timer ) ) return;
	
	switcher_interval_check( &startButton );

}





Uart_t *uart_pressure_dev = NULL;
volatile int uart_pressure_test_en = 0;
volatile int uart_pressure_round = 0; // 1000,000 times send result
void uart_pressure_test_loop()
{
	volatile int i,ms;
	unsigned char buffer[64];
	unsigned char data[4] = {0x5A,0x55,0xAA,0xA5};
	unsigned char val;
	
	if( uart_pressure_dev == NULL ) return;
	
	for( i=0; i< sizeof(buffer); i++ ) buffer[i] = data[i%4];
	
	Uart_Clear_Rx(uart_pressure_dev);
	
	Uart_Put(uart_pressure_dev,buffer,sizeof(buffer));
	
	ms=0;
	for( i=0; i< sizeof(buffer); i++ )
	{
		while(1)
		{
			if( 1 == Uart_Get(uart_pressure_dev, &val,1) )
			{
				ms = 0;
				if( val != buffer[i] ){
					_LOGE("Uart test Failed\n");
					systick_delay_ms(10);
					uart_pressure_test_en =0;
					return;
				}
				break;
			}else{
				if( ms > 50 ){
					_LOGE("Time Out\n");
					systick_delay_ms(10);
					uart_pressure_test_en =0;
					return;
				}else{
					systick_delay_ms(1);
					ms++;
				}
			}
		}
	}

	uart_pressure_round += sizeof(buffer);
	if( uart_pressure_round >= 1000000 ) {
		uart_pressure_round = 0;
		_LOGW("Test 1000000 bytes OK\n");
	}
}


volatile int Ameter_en_cnt;
volatile float Ameter_val;
volatile int  Ameter_val_count;

void Ameter_init()
{
	miniMeter_init( &Ameter ,AMETER_UART , 0x00);
	Ameter_en_cnt = 0;
	Ameter_val_count = 0;
}

