RuanJG/stm32App/source/app/app_CSWL_Control_Board.c
int Ameter_start( int cnt )
{
	Ameter_en_cnt = cnt;
	
	if( Ameter_en_cnt == 0 ){
		miniMeter_stop(&Ameter);
		return 1;
	}else{
		if( 1 == miniMeter_start(&Ameter) ){
			Ameter_val_count = 0;
			Ameter_val = 0;
			return 1;
		}else{
			Ameter_en_cnt = 0;
			return 0;
		}
	}
}

void Ameter_even()
{
	float value;
	unsigned char data[4];
	
	if( Ameter_en_cnt == 0 ) return;
	
	if( 1== miniMeter_check( &Ameter, &value) ){
		Ameter_val_count++;
		Ameter_val += value;
		if( Ameter_val_count >= Ameter_en_cnt ){
			Ameter_val /= Ameter_val_count;
			memcpy( data, (unsigned char*) &Ameter_val , 4 );
			if( 0 == PMSG_send_msg( &PC_pmsg , PC_TAG_DATA_AMETER, data , sizeof(data) ) ){
				PC_LOGE("Ameter_even: send data to PC error");
			}
			Ameter_val_count = 0;
			Ameter_val = 0;
		}
	}
}


/*
volatile int Vmeter_en_cnt;
volatile float Vmeter_val;
volatile int  Vmeter_val_count;

void Vmeter_init()
{
	miniMeter_init( &Vmeter ,VMETER_UART , 0x00);
	Vmeter_en_cnt = 0;
	Vmeter_val_count = 0;
}

int Vmeter_start( int cnt )
{
	Vmeter_en_cnt = cnt;
	
	if( Vmeter_en_cnt == 0 ){
		miniMeter_stop(&Vmeter);
		return 1;
	}else{
		if( 1 == miniMeter_start(&Vmeter) ){
			Vmeter_val_count = 0;
			Vmeter_val = 0;
			return 1;
		}else{
			Vmeter_en_cnt = 0;
			return 0;
		}
	}
}

void Vmeter_even()
{
	float value;
	unsigned char data[4];
	
	if( Vmeter_en_cnt == 0 ) return;
	
	if( 1== miniMeter_check( &Vmeter, &value) ){
		Vmeter_val_count++;
		Vmeter_val += value;
		if( Vmeter_val_count >= Vmeter_en_cnt ){
			Vmeter_val /= Vmeter_val_count;
			memcpy( data, (unsigned char*) &Vmeter_val , 4 );
			if( 0 == PMSG_send_msg( &PC_pmsg , PC_TAG_DATA_VMETER, data , sizeof(data) ) ){
				PC_LOGE("Vmeter_even: send data to PC error");
			}
			Vmeter_val_count = 0;
			Vmeter_val = 0;
		}
	}
}
*/




#if USING_TONGHUI_TH963_VMETER

// cmd 'MEAS:VOLT:DC? 100\n' -> '2.45693330E-04\r\n'  or  '-2.45693330E-04\r\n' 

//or 
	
// cmd 'conf:volt:dc 100;:trig:sour bus;:trig:coun 1;:samp:coun 3\n' ,  'read?;*trg' or 'init;fetc?;*trg\n'
// cmd 'abort'

//*CLS 清除错误信息
//:SYSTem:ERROr?  读错误信息  -> 0,"No error";\n    或  -113,"Undefined header"\n  （ 8165 支持， th963 不支持,因它直接反回cmd错误信息）
//*RST 回复到开机状态 
//:LOCal ( 8165 no support , th963 support )

#define TH963_BUFFER_SIZE 32

typedef struct TH963_Meter {
	systick_time_t timer;
	Uart_t *uart;
	volatile float measureVal;
	volatile unsigned char updated;
	volatile unsigned char started;
	char cmdRes[TH963_BUFFER_SIZE];
	volatile int cmdStep;
	volatile int initStep;
	volatile int cmdbufferIndex;
}TH963_Meter_t;


void TH963_cmd_reset(TH963_Meter_t * th963)
{
	th963->cmdbufferIndex = 0;
	th963->cmdRes[0] =0;
	th963->cmdStep = 0;
	Uart_Clear_Rx( th963->uart );
}

// get a string : return 1 , result store in th963->cmdRes
// otherwise : return 0
int TH963_cmd_read_string( TH963_Meter_t * th963 )
{
	volatile unsigned char data;
	
	while(1)
	{
		if( 1 == Uart_Get( th963->uart, &data ,1 ))
		{
			if( th963->cmdbufferIndex >= (sizeof( th963->cmdRes ) -2) )
			{
				th963->cmdbufferIndex = 0;
				PC_LOGE("TH963_cmd_read_string: overflow!");
			}
			th963->cmdRes[ th963->cmdbufferIndex++ ] = data;
			if( data == '\n' )
			{
				th963->cmdRes[ th963->cmdbufferIndex++ ] = 0;
				th963->cmdbufferIndex = 0;
				return 1;
			}
		}else{
			return 0;
		}
	}
}	


//0 : waiting for cmd runing
//1 : finish , result in th963->cmdRes 
//-1 : error / failed , result in th963->cmdRes 
int TH963_cmd_even(TH963_Meter_t * th963, char * cmd , int timeoutMs , int waitResult , int waitTimeout)
{
	int rest;
	volatile unsigned char data;
	
	rest = 0;
	
	switch( th963->cmdStep )
	{		
		case 0:  // send cmd
			TH963_cmd_reset( th963 );
			Uart_Put(th963->uart, (unsigned char*) cmd, strlen(cmd));
			th963->cmdStep++;
			systick_init_timer( &th963->timer, timeoutMs);
		break;
		
		case 1: // verify cmd 
			// if has result , no  wait for cmd error msg
			if( waitResult == 1 ){
				th963->cmdStep++;
				break;
			}
			
			// if any string send by meter , it should be the error msg
			// error string store in th963->cmdRes
			if( 1 == TH963_cmd_read_string( th963 ) ){
				rest = -1;
				break;
			}
			
			//if not require reply string , timeout meant ok;
			if( 1 == systick_check_timer( &th963->timer ) ){
				rest = 1;
				break;
			}
		break;
			
		case 2: //get result
			if( 1 == TH963_cmd_read_string( th963 ) )
			{
				#if 0 // th963 will reply the Error imediaterily
				if( strncmp(th963->cmdRes, "Error 5", 7) == 0){
					PC_LOGE("TH963_cmd_even: Unknow cmd  !");
					rest = -1;
					break;
				}
				#endif
				
				if( waitTimeout != 0 && 0 == systick_check_timer( &th963->timer ) ) {
					th963->cmdStep++;
					break;
				}else{
					rest = 1;
					break;
				}
			}
			
			if( 1 == systick_check_timer( &th963->timer ) ){
				PC_LOGE("TH963_cmd_even: cmd timeout !");
				rest = -1;
				break;
			}
		break;
			
			
		case 3: // some cmd need time to delay , this step just like for interval cmd loop
			if( 1 == systick_check_timer( &th963->timer ) ){
				rest = 1;
			}
		break;
		
		default:
			PC_LOGE("TH963_cmd_even: error step!");
		break;
	}
	
	if( rest != 0 )
		th963->cmdStep = 0;
	
	return rest;
}

int TH963_cmd_sync(TH963_Meter_t * th963, char * cmd , int delayMs, int has_result)
{
	int val = 0;
	
	while( 1 ){
		val = TH963_cmd_even( th963, cmd , delayMs, has_result , 0) ;
		if( val  != 0 ) break;
	}
	
	return val;
}



TH963_Meter_t Vmeter_th963;


void TH963_clear(TH963_Meter_t * th963)
{
	th963->started = 0;
	th963->updated = 0;
	th963->initStep = 0;
	TH963_cmd_reset( th963 );
}

int TH963_init(TH963_Meter_t * th963, Uart_t *uart_p )
{
	th963->uart = uart_p;
	TH963_clear(th963);
	return 0;
}

int TH963_start( TH963_Meter_t * th963 , int en )
{
	if( th963->started == 0 && en ==1 ){
		
		TH963_clear( th963 );
		
		// flush the unknow bytes in meter rs232 pipe
		TH963_cmd_sync( th963, "\n", 200, 0) ;
		
		if( 1 != TH963_cmd_sync( th963, "*RST\n", 500, 0) ){
			PC_LOGE("TH963 RST error : %s\n",th963->cmdRes);
		}
	}
	
	th963->started = en;
	
